BankXml/RTGS_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getStrukturaRtgsNalogaRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://strukturaRtgsNaloga.xml.com" xmlns:ns4="http://mt102.xml.com" xmlns:ns5="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>FoFbUiHHlSSCrXABKTlUfibjWoG1TlVLrNl3xLFO2xxETJhLGt4+bLTB/B7QNoxTADABytemuMbp&#13;
dbc0i+NiHWLuDWTDFU0S8eFKtU/N0QWX0/ZPUnBD7rr26GO/2N0+189NqSS4b9S53zdlAaobnRc+&#13;
qSa0k//yNaqNN4DjvZEn4Kjvlc9q604HXIg3Mp6UPdWpgamn7NvGkH8Y+kjVJCubMkT/oYZ/hG4q&#13;
J1Hgw8CAYErpvp+NsnbdD6xedYd78BORpG+teirh1OZaXQDUaTj0VQyE4aqMDbI0T3nqWwkGSmMd&#13;
hkCqH5Veg2y+GUb3CYavmoco2vqlkgCMsb4DIQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>hb3bv11iarQY/N/G7bk4jwZrjpZG7vgrg+LTn3QHoG+9EcRV0t6SYthKaWABvGTfskhp+lF4EqTn&#13;
41SPTERgoJErmzLMGT5CVxMI4cQueAnrCYzSUAFlfVrHaVkW1Nv7mmfbGMBvSDZ6ewXQxLW5dvlf&#13;
i6c7/qsZwCqOw8mAC/Pw465u0+sF1cI4df1WSIKXSTZ2VQcznq57Dh6S+ChEhhhEGHs7cXoTJr5R&#13;
dbzZlXD/GkilcdPhQmeI3jQJbcTjJKot6qoPpTQG9SXTw7ig7W1G96VxOjJYtstdRNdRepUF9xvJ&#13;
dqeqBD2k5UrtAJ/uxwpEiyk2pmKHCdkGT+YJo5X0Huft/xHS/rpodE5jkbV6IpIR8n1atuwqbGDq&#13;
RZaWl2pXhQEEuQn5p5Ogw/vfnXAzDAe/lLnPCKTRKE83wM4ORA+tRa5LyBgTsk8gPA6jEDbcHswh&#13;
UTNCWf1Co8b3+g9mlmO9vO6t1MdwSGVT5c1ib2YPyUJ5KYRjck0bpj5jnXzja8ZJ7EQZ2RBM8Hgh&#13;
8ZT6Z4rrBYv60VPJGbR/RiZ50QYP1Cf8On8HGrE3MZGLwof9FqkeVSHh6f/ObleFDAEht618CpcK&#13;
BMKfdFtdidN0aogKAsDqrUF89nDfymPhg7R3g/3DlFxbgIHDd/6U5n4xH9mP05svjfU/WMthheZR&#13;
f8JYpuNP5eWmNx7TI3WOoHcj7PFRXOukGLsp3xaQm4LVQiNVzk8WPKhQ+UBpW0+IdnjEVEwEPhaz&#13;
C20OK9VIuOS64pdTc31dUI26yR7DifekiGb6ADnxZDqS9oD3f3+ZhDSklUlgkGyaqUHVtFmhV1C8&#13;
c9n4jAP7Rte6kbxx6duxdvjNzYJvRrFcvindhxU1MRrB31M8TTndIV4ReVR32Dc3YKhFw50zDROy&#13;
4g9RQVUw7ncJ7sWNYRhynFaSeDAr1BWGyBNkIOhAdc4CW8hlwi6uSY7winc6bRcmesji/5YksYj5&#13;
9WzCazpTct32gTEOofyzCmUccqvOvZl4OIjgZqE+qQMWLU4GRq6GrKCCqZcR5ftOKpONb0GTv9os&#13;
3F7SP0FaC3Os9z+fx0uBMSYmPIy3btJKJt+6bu4ONspmC8W28XKNPEyQy0Q31Gs52u9RV6iH+RhR&#13;
p1q2m7VSoP+QWNWfFgNW5gEiyquMF//3/jmjlkphMHMZv5VCXQyf7Dsm9FayfL7nuInjhRPnJgWY&#13;
eaK6/CvLdzqaNXWcLN1ybpAxkCCVw6z4H557vIFpAXlSHJLzGuiHjoD9LtcPOjN7T85UYNQgR92e&#13;
Hy7wuwy3g6AHtkJ8z+JyH1kCw/LGiRANORZqBZ7bMbhAnAqo1Q/gTO0CoYPUpNONV98ooququQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getStrukturaRtgsNalogaRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>IY+wFxY2IlgsCHYXej7uBs5qwj4=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
a5tYh1fkpx1bYaQhxZMy4mvEeDykuU5pteihd7qcwzXrs3lAAUFVr8a7Dg2PJxRPwy9WtpbZlPca&#13;
qvKZSzmTEoouBeTQsvCy/21hSQYhRi5mkS+f52zCco07EuZH2v/cz42DZxhloSUG5Wjft5XJqOmL&#13;
jFCOTdG16pKxKmOC7pr+ByJq0nql6dTrysWExkiKaIhdIIOkHWCIm6zwWOi75N50VbbW2UpmvAJU&#13;
VCYaKE1s2Hh1pmzMOj3cxYXyHi//hxzP3QlcaGURLn6C8q1kHiVI0EmulsFXuLJyQkiq54OByoBN&#13;
f7bOi0N5zT77bMQLj8jYwtIbCsRgSO0R3lVb9A==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iYFqE4e3bUjAttedcKZSAisg5+YICC8Yf0MmjWxsj5XjlN5kZN6T1RC6zXYH7U2nokaxjGxEeKvq&#13;
gvCJfwiBo+t2lGFyaOU3dietqZWr0scIpm0rVoazZPgCzo3PPK1VBWpyOA7/1UZpPJYxIoQq0ZrR&#13;
NGJPIKLff/UQtyjgf1AQZN7+6Ey5MKfG0NNQtvoO8AgL0CGe81+ziZ7GjbIR11OodRAkFxSz7xeb&#13;
DWOWK5L1jDwPPkyoFpyybsD45Vld/1z0M6kDFzyCm/ha37vqGBBGSKudUVztnMY/jwo9ja3Yd93Q&#13;
3Pe2lZfRAj5qykiOd8WEq4KDJ7/zWU1f0nsu5Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDoDCCAoigAwIBAgIEWUhQxDANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQD&#13;
DAdCYW5rYSBBMRAwDgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3Ji&#13;
MRowGAYJKoZIhvcNAQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIw&#13;
ggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCJgWoTh7dtSMC2151wplICKyDn5ggILxh/&#13;
QyaNbGyPleOU3mRk3pPVELrNdgftTaeiRrGMbER4q+qC8Il/CIGj63aUYXJo5Td2J62plavSxwim&#13;
bStWhrNk+ALOjc88rVUFanI4Dv/VRmk8ljEihCrRmtE0Yk8got9/9RC3KOB/UBBk3v7oTLkwp8bQ&#13;
01C2+g7wCAvQIZ7zX7OJnsaNshHXU6h1ECQXFLPvF5sNY5YrkvWMPA8+TKgWnLJuwPjlWV3/XPQz&#13;
qQMXPIKb+Frfu+oYEEZIq51RXO2cxj+PCj2Nrdh33dDc97aVl9ECPmrKSI53xYSrgoMnv/NZTV/S&#13;
ey7lAgMBAAGjEzARMA8GA1UdEwEB/wQFMAMBAf8wDQYJKoZIhvcNAQELBQADggEBAG97A295MjBs&#13;
W9KAIx7/VlBabr8edSQbwNqaLPJLT5LeXqrCTaBeBstdUnbxRCduSIoV96h3+ogy22lBm5viOXER&#13;
psHpIRtjoSogXu79aPwGuXfh9ZwcJ0snkOpAC1eITJK2j1gOzT/dj8SY5RP7ptosw0o6HwgzyljK&#13;
O1eNN5AunHsAjCkJMn1eyJJW8bZkjp3HajxoHM5Y7dGc3GYi018+StfkjZC51kj4ZrjRsklhIrrC&#13;
cbKkMsD/PPaZUN96KbMev6exKS3gXxBkyi/4TKpbNblT60MheU7fWgOodF9bswi0x31dftQibjms&#13;
lxmeTI40cje1sxblOwNPGNOc0OA=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>